[
  {
    "section": {
      "num": "1",
      "title": "АЛГОРИТМ І ТА ОБЧИСЛЮВАЛЬНА СКЛАДНІСТЬ",
      "subsections": [
        {
          "num": "1.1",
          "title": "Основи структури даних і алгоритми",
          "subsubsections": [
            {
              "num": "1.1.1",
              "title": "Поняття алгоритму. Визначення його часової та просторової (за обсягом пам’яті) складності"
            },
            {
              "num": "1.1.2",
              "title": "Поняття абстрактного типу даних. Абстрактні типи даних: стеки, списки, вектори, словники, множини, мультимножини, черги, черги з пріоритетами"
            },
            {
              "num": "1.1.3",
              "title": "Кортежі, множини, словники, одно- та двобічнозв'язні списки. Реалізація абстрактних типів даних з оцінюванням складності операцій"
            },
            {
              "num": "1.1.4",
              "title": "Базові алгоритми та їх складність: пошук, сортування (прості сортування вибором, вставками, обмінами та удосконалені сортування деревом, сортування Шелла, швидке сортування)"
            },
            {
              "num": "1.1.5",
              "title": "Алгоритми на графах та їх складність: пошук в ширину і глибину; пошук зв'язних компонентів; побудова кістякового дерева; побудова найкоротших шляхів з виділеної вершини; побудова найкоротших шляхів між двома вершинами"
            }
          ]
        },
        {
          "num": "1.2",
          "title": "Стратегії розроблення алгоритмів",
          "subsubsections": [
            {
              "num": "1.2.1",
              "title": "Стратегія «розділяй та володарюй» та приклади застосування"
            },
            {
              "num": "1.2.2",
              "title": "Стратегія балансування та приклади застосування"
            },
            {
              "num": "1.2.3",
              "title": "Динамічне програмування та приклади застосування"
            },
            {
              "num": "1.2.4",
              "title": "Оцінювання складності алгоритму під час застосування кожної стратегії"
            }
          ]
        },
        {
          "num": "1.3",
          "title": "Моделі обчислень",
          "subsubsections": [
            {
              "num": "1.3.1",
              "title": "Імперативний та декларативний підходи до програмування"
            },
            {
              "num": "1.3.2",
              "title": "Розв'язні, напіврозв'язні та нерозв'язні проблеми. Проблема зупинки"
            }
          ]
        }
      ]
    }
  },
  {
    "section": {
      "num": "2",
      "title": "АРХІТЕКТУРА ОБЧИСЛЮВАЛЬНИХ СИСТЕМ",
      "subsections": [
        {
          "num": "2.1",
          "title": "Функції бінарної логіки"
        },
        {
          "num": "2.2",
          "title": "Позиційні системи числення",
          "subsubsections": [
            {
              "num": "2.2.1",
              "title": "Позиційні системи числення. Двійкова, вісімкова, шістнадцяткова системи числення. Беззнаковий код цілих чисел. Доповнювальний код цілих чисел. Основні арифметичні операції над цілими числами в беззнаковому та доповнювальному кодах"
            },
            {
              "num": "2.2.2",
              "title": "Принципи зображення дійсних чисел в пам’яті програми у форматі з плаваючою комою. Переваги та недоліки форматів чисел з плаваючою комою. Основні арифметичні операції над дійсними числами у форматі з плаваючою комою та їхні проблеми"
            }
          ]
        },
        {
          "num": "2.3",
          "title": "Пристрої введення-виведення. Поняття шини комп'ютера"
        },
        {
          "num": "2.4",
          "title": "Функціональна організація обчислювальних систем",
          "subsubsections": [
            {
              "num": "2.4.1",
              "title": "Структура комп'ютера, класична архітектура фон Неймана, гарвардська архітектура"
            },
            {
              "num": "2.4.2",
              "title": "Ієрархічний принцип побудови пам'яті - регістрова, кеш, оперативна пам'ять, зовнішня пам'ять. CPU"
            },
            {
              "num": "2.4.3",
              "title": "Периферійні пристрої"
            }
          ]
        }
      ]
    }
  },
  {
    "section": {
      "num": "3",
      "title": "БАЗИ ТА СХОВИЩА ДАНИХ",
      "subsections": [
        {
          "num": "3.1",
          "title": "Ключі та нормалізація даних: основні нормальні форми (1NF, 2NF, 3NF, BCNF)"
        },
        {
          "num": "3.2",
          "title": "Основні концепції систем баз даних: модель даних; мова запитів; транзакція; ACID властивості транзакції, індексування; резервне копіювання та відновлення; розподіленість і реплікація даних; безпека даних"
        },
        {
          "num": "3.3",
          "title": "Моделювання даних: створення моделі даних для інформаційної системи; концептуальна, логічна, фізична моделі даних; ER-модель; нотації ER-моделей"
        },
        {
          "num": "3.4",
          "title": "Реляційні бази даних: особливості організації та зберігання даних у реляційних базах даних; основні характеристики реляційних баз даних; DBMS (Database Management System)"
        },
        {
          "num": "3.5",
          "title": "Побудова запиту: мови SQL (structured query language), DDL (Data Definition Language), DML (Data Manipulation Language), DCL (Data Control Language), TCL (Transaction Control Language)"
        },
        {
          "num": "3.6",
          "title": "Обробка запитів: основні операції реляційної алгебри: відбір (selection), проекція (projection), об'єднання (union), перетин (intersection), різниця (difference), декартовий добуток (cartesian product), об'єднання за атрибутом (Join), ділення (Division)"
        }
      ]
    }
  },
  {
    "section": {
      "num": "4",
      "title": "ІНЖЕНЕРІЯ СИСТЕМ І ПРОГРАМНОГО ЗАБЕЗПЕЧЕННЯ",
      "subsections": [
        {
          "num": "4.1",
          "title": "Складні та великі системи",
          "subsubsections": [
            {
              "num": "4.1.1",
              "title": "Властивості систем: емерджентність, адитивність, еквіфінальність"
            },
            {
              "num": "4.1.2",
              "title": "Відкриті та закриті системи; класифікація за призначенням, походженням, видом елементів, способом організації"
            },
            {
              "num": "4.1.3",
              "title": "Спільне та відмінності складних і великих систем"
            }
          ]
        },
        {
          "num": "4.2",
          "title": "Моделі систем",
          "subsubsections": [
            {
              "num": "4.2.1",
              "title": "Склад і структура системи; моделі типу чорної та білої скриньки"
            },
            {
              "num": "4.2.2",
              "title": "Концептуальні, математичні і комп’ютерні моделі"
            },
            {
              "num": "4.2.3",
              "title": "Зв’язок між системою та моделлю; ізо- та гомоморфізм"
            }
          ]
        },
        {
          "num": "4.3",
          "title": "Інформаційні системи",
          "subsubsections": [
            {
              "num": "4.3.1",
              "title": "Поняття, цілі, значення, класифікація за функціональністю, масштабом, сферою застосування"
            },
            {
              "num": "4.3.2",
              "title": "Забезпечення інформаційних систем: організаційне, інформаційне, математичне, програмне, технічне, лінгвістичне, методичне, правове"
            }
          ]
        },
        {
          "num": "4.4",
          "title": "Аналіз вимог",
          "subsubsections": [
            {
              "num": "4.4.1",
              "title": "Класифікація вимог до програмного забезпечення, джерела та методи збирання вимог"
            },
            {
              "num": "4.4.2",
              "title": "Вимоги користувача (варіанти використання та історії користувачів)"
            },
            {
              "num": "4.4.3",
              "title": "Функціональні та нефункціональні вимоги, обмеження; структуризація функціональних вимог"
            }
          ]
        },
        {
          "num": "4.5",
          "title": "Проектування програмного забезпечення",
          "subsubsections": [
            {
              "num": "4.5.1",
              "title": "Види проектування: Структурне проектування (Structural Design), Об’єктно-орієнтоване проектування (Object-Oriented Design), Функціональне проектування (Functional Design), Архітектурне проектування (Architectural Design), Інтерфейсне проектування (Interface Design)"
            },
            {
              "num": "4.5.2",
              "title": "Парадигми проектування: функціональна декомпозиція згори донизу, архітектура, орієнтована на дані, об'єктно-орієнтований аналіз та проектування, подієво-керована архітектура"
            },
            {
              "num": "4.5.3",
              "title": "Ідентифікація класів предметної області. UML діаграми ієрархії класів: моделювання підсистем, класів та зв’язків між ними"
            },
            {
              "num": "4.5.4",
              "title": "Проектування сценаріїв реалізації варіантів використання на основі UML-діаграм послідовностей та комунікації"
            },
            {
              "num": "4.5.5",
              "title": "Основні патерни проектування: MVC, Abstract Factory, Facade, Decorator, Flyweight, Visitor, Observer, Proxy, Strategy, Chain of Responsibility"
            }
          ]
        },
        {
          "num": "4.6",
          "title": "Реалізація програмного забезпечення",
          "subsubsections": [
            {
              "num": "4.6.1",
              "title": "Вимоги до оформлення коду: стиль, розбиття на структуровані одиниці, найменування змінних, класів, об’єктів"
            },
            {
              "num": "4.6.2",
              "title": "Засоби автоматичної генерації програмного коду"
            },
            {
              "num": "4.6.3",
              "title": "Налагодження: точки зупинки (Breakpoints), спостереження за змінними (Variable Watch), виведення на консоль (Console Output), налагоджувач (Debugger), аналізатори коду (Code Analyzers)"
            },
            {
              "num": "4.6.4",
              "title": "Керування конфігурацією та версіями програмного забезпечення"
            },
            {
              "num": "4.6.5",
              "title": "Постійна інтеграція/постійне впровадження (Continuous Integration/Continuous Delivery)"
            }
          ]
        },
        {
          "num": "4.7",
          "title": "Забезпечення якості: спільне та відмінності процесів тестування, верифікації, валідації",
          "subsubsections": [
            {
              "num": "4.7.1",
              "title": "Тестування методами білої та чорної скрині"
            },
            {
              "num": "4.7.2",
              "title": "Рівні тестування: модульний, інтеграційний, системний, валідаційний"
            },
            {
              "num": "4.7.3",
              "title": "Розробка через тестування (Test-driven development)"
            },
            {
              "num": "4.7.4",
              "title": "Додаткові техніки верифікації та валідації: інспекція коду, перевірка на відповідність стандартам і вимогам, оцінювання зручності використання та користувацького досвіду, перевірка продуктивності та масштабованості"
            }
          ]
        },
        {
          "num": "4.8",
          "title": "Командна робота, підходи до розробки програмного забезпечення (ПЗ)",
          "subsubsections": [
            {
              "num": "4.8.1",
              "title": "Класичні моделі розробки ПЗ: каскадна (водоспадна), ітераційна, інкрементна"
            },
            {
              "num": "4.8.2",
              "title": "Промислові технології розробки ПЗ: RUP, MSF, Agile, Scrum, Extreme Programming (XP), Kanban"
            },
            {
              "num": "4.8.3",
              "title": "Ролі та обов'язки у команді проекту, переваги командної роботи, ризики та складність такої співпраці"
            },
            {
              "num": "4.8.4",
              "title": "Основні етапи планування і виконання IT проекту. Життєвий цикл IT проекту"
            }
          ]
        }
      ]
    }
  },
  {
    "section": {
      "num": "5",
      "title": "КІБЕРБЕЗПЕКА ТА ЗАХИСТ ІНФОРМАЦІЇ",
      "subsections": [
        {
          "num": "5.1",
          "title": "Основи кібербезпеки",
          "subsubsections": [
            {
              "num": "5.1.1",
              "title": "Поняття кіберпростору та інформаційного простору"
            },
            {
              "num": "5.1.2",
              "title": "Інформаційна безпека як сфера національної безпеки України, безпеки підприємства/установи, особистої безпеки"
            },
            {
              "num": "5.1.3",
              "title": "Поняття кібербезпеки, захисту інформації та кіберзахисту"
            },
            {
              "num": "5.1.4",
              "title": "Види захисту інформації: технічний, Інженерний криптографічний, організаційний"
            },
            {
              "num": "5.1.5",
              "title": "Поняття конфіденційності, цілісності, доступності"
            },
            {
              "num": "5.1.6",
              "title": "Принципи кібербезпеки"
            }
          ]
        },
        {
          "num": "5.2",
          "title": "Кіберзагрози та кібератаки",
          "subsubsections": [
            {
              "num": "5.2.1",
              "title": "Поняття загроз, атак, вразливості"
            },
            {
              "num": "5.2.2",
              "title": "Класифікація загроз, атак"
            },
            {
              "num": "5.2.3",
              "title": "Кіберзлочини. Кібервійна. Кібероборона"
            },
            {
              "num": "5.2.4",
              "title": "КІбертероризм. Кіберрозвідка"
            },
            {
              "num": "5.2.5",
              "title": "Модель порушника"
            },
            {
              "num": "5.2.6",
              "title": "Поняття, сутність та основні завдання комплексної системи захисту інформації"
            }
          ]
        },
        {
          "num": "5.3",
          "title": "Безпека мережі",
          "subsubsections": [
            {
              "num": "5.3.1",
              "title": "Поняття про шкідливе програмне забезпечення"
            },
            {
              "num": "5.3.2",
              "title": "Шпигунські програми, фішинг, програми-вимагачі"
            },
            {
              "num": "5.3.3",
              "title": "DDoS-атаки"
            }
          ]
        }
      ]
    }
  },
  {
    "section": {
      "num": "6",
      "title": "МАТЕМАТИКА В ІТ",
      "subsections": [
        {
          "num": "6.1",
          "title": "Застосування методів математичного аналізу, аналітичної геометрії, лінійної алгебри в ІТ",
          "subsubsections": [
            {
              "num": "6.1.1",
              "title": "Числова послідовність та її границя. Нескінченно малі та великі величини. Порівняння нескінченно малих і великих величин"
            },
            {
              "num": "6.1.2",
              "title": "Похідна та її застосування для дослідження функцій однієї змінної"
            },
            {
              "num": "6.1.3",
              "title": "Обчислення визначених інтегралів (метод прямокутників, метод трапецій)"
            },
            {
              "num": "6.1.4",
              "title": "Застосування функцій багатьох змінних. Частинні похідні. Необхідні і достатні умови екстремуму"
            },
            {
              "num": "6.1.5",
              "title": "Методи оптимізацІЇ: Основні поняття та цілі в задачах лінійного та нелінійного програмування. Метод градієнтного спуску: Ідея та алгоритм"
            },
            {
              "num": "6.1.6",
              "title": "Апроксимація даних. Метод найменших квадратів (лінійна залежність)"
            },
            {
              "num": "6.1.7",
              "title": "Числові ряди та поняття їх збіжності. Ступеневі ряди"
            },
            {
              "num": "6.1.8",
              "title": "Основні означення теорії диференціальних рівнянь: порядок диференціального рівняння, частинний розв’язок, загальний розв'язок, задача Коші. Поняття про ітераційні методи їх розв’язування"
            },
            {
              "num": "6.1.9",
              "title": "Пряма і площина в просторі. Поняття гіперплощини. Криві і поверхні другого порядку. Еліпс, гіпербола, парабола"
            },
            {
              "num": "6.1.10",
              "title": "Матриці та дії з матрицями. Визначники. Обернена матриця"
            },
            {
              "num": "6.1.11",
              "title": "Власні вектори та власні числа матриці"
            },
            {
              "num": "6.1.12",
              "title": "Системи лінійних алгебраїчних рівнянь, умови їх розв’язності. Чисельні методи їх розв’язання"
            },
            {
              "num": "6.1.13",
              "title": "Лінійний векторний простір та його основні властивості. Розмірність і базис простору"
            }
          ]
        },
        {
          "num": "6.2",
          "title": "Дискретна математика",
          "subsubsections": [
            {
              "num": "6.2.1",
              "title": "Поняття множини. Операції над множинами: об’єднання, перетин, різниця, доповнення, булеан множини, декартів добуток"
            },
            {
              "num": "6.2.2",
              "title": "Бінарні відношення та їх властивості: рефлексивність, симетричність, транзитивність"
            },
            {
              "num": "6.2.3",
              "title": "Комбінаторний аналіз. Правило суми та добутку. Сполуки, перестановки, розміщення: без повторень та з повтореннями. Принцип включень і виключень"
            },
            {
              "num": "6.2.4",
              "title": "Елементи математичної логіки. Логічні сполучники. Таблиці істинності. Булеві функції. Форми подання булевих функцій. Логіка висловлювань"
            },
            {
              "num": "6.2.5",
              "title": "Графи. Типи графів: Орієнтовні та неорієнтовні графи. Вершини та ребра, ступінь вершини, суміжність. Ізоморфізм графів. Операції над графами: об’єднання, пряма сума, доповнення, вилучення ребра, вилучення вершини"
            },
            {
              "num": "6.2.6",
              "title": "Маршрути, ланцюги, цикли та їх різновиди у графах"
            },
            {
              "num": "6.2.7",
              "title": "Зв’язність графів, компоненти зв’язності неорієнтованих графів. Відстань між вершинами"
            },
            {
              "num": "6.2.8",
              "title": "Дерева, ліси: основні поняття"
            }
          ]
        },
        {
          "num": "6.3",
          "title": "Застосування теорії ймовірностей та математичної статистики в ІТ",
          "subsubsections": [
            {
              "num": "6.3.1",
              "title": "Стохастичний експеримент. Простір елементарних подій. Операції над подіями. Комбінаторна та геометрична ймовірності. Умовна ймовірність"
            },
            {
              "num": "6.3.2",
              "title": "Формула повної ймовірності. Формула Байєса. Схема незалежних випробувань Бернуллі. Закон великих чисел"
            },
            {
              "num": "6.3.3",
              "title": "Числові характеристики одновимірних випадкових величин (математичне сподівання, середнє значення, медіана та дисперсія)"
            },
            {
              "num": "6.3.4",
              "title": "Поняття розподілу випадкової величини. Функція розподілу. Щільність розподілу. Рівномірний та нормальний розподіли"
            },
            {
              "num": "6.3.5",
              "title": "Поняття статистичного зв’язку. Лінійна і логістична регресія. Коефіцієнт парної кореляції"
            },
            {
              "num": "6.3.6",
              "title": "Багатовимірні дискретні величини. Поняття про сумісний розподіл. Кореляційна матриця"
            },
            {
              "num": "6.3.7",
              "title": "Поняття випадкової функції та випадкового процесу"
            },
            {
              "num": "6.3.8",
              "title": "Основні задачі математичної статистики. Первинна обробка даних"
            },
            {
              "num": "6.3.9",
              "title": "Візуалізація даних (точкова діаграма, гістограма, стовпчаста діаграма, кругова діаграма)"
            },
            {
              "num": "6.3.10",
              "title": "Точкові та інтервальні оцінки характеристик випадкових величин. Довірчі інтервали"
            },
            {
              "num": "6.3.11",
              "title": "Основні поняття та перевірка статистичних гіпотез (нульова гіпотеза, альтернативна гіпотеза, рівень значущості, однорідність нормально розподілених вибірок)"
            }
          ]
        }
      ]
    }
  },
  {
    "section": {
      "num": "7",
      "title": "МЕРЕЖІ ТА ОБМІН ДАНИМИ",
      "subsections": [
        {
          "num": "7.1",
          "title": "Класифікація та функції комп'ютерних мереж. Комутація каналів і комутація пакетів. Топології комп'ютерних мереж"
        },
        {
          "num": "7.2",
          "title": "Поняття протоколу та інтерфейсу, ієрархія протоколів, потік інформації в мережі. Еталонні моделі ISO/OSI та TCP/IP"
        },
        {
          "num": "7.3",
          "title": "Інтернет речей: основні поняття, сфери застосування"
        }
      ]
    }
  },
  {
    "section": {
      "num": "8",
      "title": "ОПЕРАЦІЙНІ СИСТЕМИ",
      "subsections": [
        {
          "num": "8.1",
          "title": "Призначення операційних систем",
          "subsubsections": [
            {
              "num": "8.1.1",
              "title": "Різновиди операційних систем (однокористувацькі, багатокористувацькі, реального часу)"
            },
            {
              "num": "8.1.2",
              "title": "Основні функції операційних систем"
            },
            {
              "num": "8.1.3",
              "title": "Вимоги до операційних систем, поняття відмовостійкості"
            }
          ]
        },
        {
          "num": "8.2",
          "title": "Файлові системи",
          "subsubsections": [
            {
              "num": "8.2.1",
              "title": "Основні поняття про файли і файлові системи"
            },
            {
              "num": "8.2.2",
              "title": "Логічна та фізична організація файлів"
            }
          ]
        }
      ]
    }
  },
  {
    "section": {
      "num": "9",
      "title": "ОСНОВИ МОВ ПРОГРАМУВАННЯ",
      "subsections": [
        {
          "num": "9.1",
          "title": "Сутність і види мов програмування",
          "subsubsections": [
            {
              "num": "9.1.1",
              "title": "Поняття класу та об'єкта в об'єктно-орієнтованому програмуванні; конструктор і деструктор, інтерфейс і реалізація"
            },
            {
              "num": "9.1.2",
              "title": "Базові концепції об'єктно-орієнтованого програмування: абстракція, інкапсуляція, спадкування, поліморфізм"
            },
            {
              "num": "9.1.3",
              "title": "Зв'язки між класами в об'єктно-оріентованому програмуванні: асоціація, агрегація, композиція, спадкування, залежність, реалізація"
            },
            {
              "num": "9.1.4",
              "title": "Порівняння процедурного та об'єктно-орієнтованого програмування"
            }
          ]
        },
        {
          "num": "9.2",
          "title": "Принципи та сфера застосування видів програмування: функціональне, логічне, подійно-орієнтоване, реактивне, узагальнене програмування"
        },
        {
          "num": "9.3",
          "title": "Моделі паралельних обчислень: класифікація Флінна"
        },
        {
          "num": "9.4",
          "title": "Трансляція та виконання: компілятор, інтерпретатор, компопувальник"
        }
      ]
    }
  },
  {
    "section": {
      "num": "10",
      "title": "ШТУЧНИЙ ІНТЕЛЕКТ",
      "subsections": [
        {
          "num": "10.1",
          "title": "Фундаментальні поняття: інтелектуальна система, агент, середовище, задачі штучного інтелекту, сильний і слабкий штучний інтелект"
        },
        {
          "num": "10.2",
          "title": "Пошук у просторі станів та подання знань",
          "subsubsections": [
            {
              "num": "10.2.1",
              "title": "Стратегії пошуку у просторі станів: пошук вшир, пошук вглиб, прямий, зворотний та двонаправлений пошук"
            },
            {
              "num": "10.2.2",
              "title": "Моделі подання знань (семантична мережа, продукційна модель)"
            }
          ]
        },
        {
          "num": "10.3",
          "title": "Машинне навчання",
          "subsubsections": [
            {
              "num": "10.3.1",
              "title": "Задача класифікації. Навчання з вчителем та без учителя"
            },
            {
              "num": "10.3.2",
              "title": "Вибір тренувальних та валідаційних даних для навчання"
            },
            {
              "num": "10.3.3",
              "title": "Поняття: штучний нейрон, штучна нейронна мережа, функції активації штучного нейрона (лінійна, порогова, сигмоїдна, радіально-базисна Гауса)"
            }
          ]
        }
      ]
    }
  }
]
